# Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой.
# Ввод: два значения типа <str>
# Вывод: значение типа <int>
# Пример:
# Hello world  - это объект  стипом данных str
# hello - это объект  стипом данных str
# 1	 - сколько раз hello встречается в строке Hello world
# hello world - берем эту же строку и ищем букву о, сколько раз она встречается
# o
# 2 - встречается 2 раза
str1 = input("введите строку 1 ")
str2 = input("введите строку 2 ")
print(str1. count(str2))
