#2. Напишите программу, которая на вход принимает 5 
# #чисел и находит максимальное из них.
#Ввод: любая коллекция значений типа <int>
#Вывод: значение типа <int>
my_list = [int(input('Введите число  ')),int(input('Введите число  ')),int(input('Введите число  ')),int(input('Введите число  ')),int(input('Введите число  '))]
print(max(my_list))